Tekla Open API Reference for Tekla Structures 2025
ControlLine Constructor
Overload List
Name | Description
ControlLine()
 Creates a new control line instance.
The default values are as follows:
Line = new LineSegment();
IsMagnetic = false;
Color = ControlLineColorEnum.YELLOW;
Extension = 0.0;
ControlLine(LineSegment, Boolean)
 Creates a new control line instance taking the line segment and magnetism as input.
Top
See Also
Reference
ControlLine Class
Tekla.Structures.Model Namespace